app/controllers/users_controller.rb

SELECT "logins".* FROM "logins"
---
	def avatar
		@login = Login.all